<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dsekt-infra","backend":"e50e75064b3caf767103d964e9a0579f21eee932c9f9ec11e46325f777255e1f","plan_job_ref":"Job Create OpenTofu plan #35 at https://github.com/datasektionen/infra/actions/runs/11038359817","plan_out_hash":"dbcb43e9f1ba6015a2f8d01b38ad27d518fe2b1e54ecefe06b6f8e4df3c5f715","plan_hash":"af89d4555926dcc348ee5d10562c28b6f12a4bfe0c8bb6c726ea7b43b9f8d8a4","plan_text_format":"diff","version":"1.44.0"} -->
OpenTofu plan for __dsekt-infra__
<details>
<summary>Plan: 16 to add, 0 to change, 5 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # aws_iam_access_key.vaultwarden_smtp will be created
+   resource "aws_iam_access_key" "vaultwarden_smtp" {
+       create_date                    = (known after apply)
+       encrypted_secret               = (known after apply)
+       encrypted_ses_smtp_password_v4 = (known after apply)
+       id                             = (known after apply)
+       key_fingerprint                = (known after apply)
+       secret                         = (sensitive value)
+       ses_smtp_password_v4           = (sensitive value)
+       status                         = "Active"
+       user                           = "vaultwarden_smtp"
    }

  # aws_iam_user.vaultwarden_smtp will be created
+   resource "aws_iam_user" "vaultwarden_smtp" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "vaultwarden_smtp"
+       path          = "/"
+       tags_all      = (known after apply)
+       unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.vaultwarden_smtp will be created
+   resource "aws_iam_user_policy_attachment" "vaultwarden_smtp" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::249254682653:policy/send_email"
+       user       = "vaultwarden_smtp"
    }

  # cloudflare_record.server_name["cerberus"] will be created
+   resource "cloudflare_record" "server_name" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "cerberus"
+       proxiable       = (known after apply)
+       ttl             = (known after apply)
+       type            = "A"
+       value           = (known after apply)
+       zone_id         = "********************************"
    }

  # cloudflare_record.server_wildcard["cerberus"] will be created
+   resource "cloudflare_record" "server_wildcard" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "*.cerberus"
+       proxiable       = (known after apply)
+       ttl             = (known after apply)
+       type            = "A"
+       value           = (known after apply)
+       zone_id         = "********************************"
    }

  # hcloud_server.cluster_hosts["cerberus"] will be created
+   resource "hcloud_server" "cluster_hosts" {
+       allow_deprecated_images    = false
+       backup_window              = (known after apply)
+       backups                    = false
+       datacenter                 = (known after apply)
+       delete_protection          = false
+       firewall_ids               = (known after apply)
+       id                         = (known after apply)
+       ignore_remote_firewall_ids = false
+       image                      = "debian-12"
+       ipv4_address               = (known after apply)
+       ipv6_address               = (known after apply)
+       ipv6_network               = (known after apply)
+       keep_disk                  = false
+       location                   = (known after apply)
+       name                       = "cerberus"
+       primary_disk_size          = (known after apply)
+       rebuild_protection         = false
+       server_type                = "cx22"
+       shutdown_before_deletion   = false
+       ssh_keys                   = [
+           "23243722",
        ]
+       status                     = (known after apply)

+       network {
+           alias_ips   = (known after apply)
+           ip          = "10.83.0.6"
+           mac_address = (known after apply)
+           network_id  = 4187470
        }
    }

  # nomad_job.vault will be created
+   resource "nomad_job" "vault" {
+       allocation_ids          = (known after apply)
+       datacenters             = (known after apply)
+       deployment_id           = (known after apply)
+       deployment_status       = (known after apply)
+       deregister_on_destroy   = true
+       deregister_on_id_change = true
+       detach                  = true
+       hcl1                    = false
+       id                      = (known after apply)
+       jobspec                 = <<-EOT
            variable "domain_name" {
              type    = string
              default = "vault.datasektionen.se"
            }
            
            job "vault" {
              namespace = "vault"
            
              group "vault" {
                network {
                  port "http" { }
                }
            
                service {
                  name     = "vault"
                  port     = "http"
                  provider = "nomad"
                  tags = [
                    "traefik.enable=true",
                    "traefik.http.routers.vault.rule=Host(`${var.domain_name}`)",
                    "traefik.http.routers.vault.tls.certresolver=default",
                  ]
                }
            
                volume "data" {
                  type = "host"
                  source = "vault/data"
                }
            
                task "vault" {
                  driver = "docker"
            
                  config {
                    image = "vaultwarden/server:1.32.0-alpine"
                    ports = ["http"]
                  }
            
                  template {
                    data = <<EOF
            DOMAIN=https://${var.domain_name}
            ROCKET_PORT={{ env "NOMAD_PORT_http" }}
            {{ with nomadVar "nomad/jobs/vault" }}
            DATABASE_URL=postgres://vaultwarden:{{ .database_password }}@postgres.dsekt.internal:5432/vaultwarden?sslmode=disable&connect_timeout=10
            SMTP_USERNAME={{ .smtp_username }}
            SMTP_PASSWORD={{ .smtp_password }}
            {{ end }}
            SMTP_HOST=email-smtp.eu-north-1.amazonaws.com
            SMTP_FROM=no-reply@datasektionen.se
            SMTP_FROM_NAME="Datasektionen Vault"
            SMTP_PORT=2465
            EOF
                    destination = "local/.env"
                    env = true
                  }
            
                  volume_mount {
                    volume = "data"
                    destination = "/data"
                  }
            
                  resources {
                    memory = 128 // MB
                  }
                }
              }
            }
        EOT
+       modify_index            = (known after apply)
+       name                    = "vault"
+       namespace               = "vault"
+       read_allocation_ids     = false
+       region                  = (known after apply)
+       rerun_if_dead           = false
+       status                  = (known after apply)
+       task_groups             = [
+           {
+               count   = 1
+               meta    = (known after apply)
+               name    = "vault"
+               task    = [
+                   {
+                       driver        = "docker"
+                       meta          = (known after apply)
+                       name          = "vault"
+                       volume_mounts = [
+                           {
+                               destination = "/data"
+                               read_only   = false
+                               volume      = "data"
                            },
                        ]
                    },
                ]
+               volumes = [
+                   {
+                       name      = "data"
+                       read_only = false
+                       source    = "vault/data"
+                       type      = "host"
                    },
                ]
            },
        ]
+       type                    = (known after apply)
    }

  # nomad_namespace.vault will be created
+   resource "nomad_namespace" "vault" {
+       id   = (known after apply)
+       name = "vault"
    }

  # nomad_variable.jobs_vault will be created
+   resource "nomad_variable" "jobs_vault" {
+       id        = (known after apply)
+       items     = (sensitive value)
+       namespace = "default"
+       path      = "nomad/jobs/vault"
    }

  # random_pet.stage1_nomad_cluster must be replaced
-/+ resource "random_pet" "stage1_nomad_cluster" {
!~      id        = "****************" -> (known after apply)
!~      keepers   = { # forces replacement
!~          "_" = "" -> (known after apply)
        }
#        (2 unchanged attributes hidden)
    }

  # module.nixos_install["ares"].module.nixos-rebuild[0].null_resource.nixos-rebuild must be replaced
-/+ resource "null_resource" "nixos-rebuild" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "store_path" = "/nix/store/lvvkd37pkxpqj2l0sja7za49anynd5nw-nixos-system-ares-24.05.20240830.6e99f2a" -> "/nix/store/p87iqjwqzh77qyp0wpp7vwmwfqc7wmk0-nixos-system-ares-24.05.20240830.6e99f2a"
        }
    }

  # module.nixos_install["cerberus"].module.install.null_resource.nixos-remote will be created
+   resource "null_resource" "nixos-remote" {
+       id       = (known after apply)
+       triggers = {
+           "instance_id" = (known after apply)
        }
    }

  # module.nixos_install["cerberus"].module.nixos-rebuild[0].null_resource.nixos-rebuild will be created
+   resource "null_resource" "nixos-rebuild" {
+       id       = (known after apply)
+       triggers = {
+           "store_path" = "/nix/store/yhk3sx5s0nilsay1hxfm3bxfc6m9mc4h-nixos-system-cerberus-24.05.20240830.6e99f2a"
        }
    }

  # module.nixos_install["hades"].module.nixos-rebuild[0].null_resource.nixos-rebuild must be replaced
-/+ resource "null_resource" "nixos-rebuild" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "store_path" = "/nix/store/7p8qkxr7r4d0pk8xi2g7vhrl9ffpcxi3-nixos-system-hades-24.05.20240830.6e99f2a" -> "/nix/store/4pb45c06p4z5izm2h53f2z3j0bsz7wdf-nixos-system-hades-24.05.20240830.6e99f2a"
        }
    }

  # module.nixos_install["poseidon"].module.nixos-rebuild[0].null_resource.nixos-rebuild must be replaced
-/+ resource "null_resource" "nixos-rebuild" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "store_path" = "/nix/store/xxkqbqrqxmgvzxhws13hymdxfzz2wyxr-nixos-system-poseidon-24.05.20240830.6e99f2a" -> "/nix/store/fyqy5hirrz4qw7awdxxp8wnqp276m11v-nixos-system-poseidon-24.05.20240830.6e99f2a"
        }
    }

  # module.nixos_install["zeus"].module.nixos-rebuild[0].null_resource.nixos-rebuild must be replaced
-/+ resource "null_resource" "nixos-rebuild" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "store_path" = "/nix/store/8a55p4grwiqg4awc1hf8m9a0pxdmw153-nixos-system-zeus-24.05.20240830.6e99f2a" -> "/nix/store/pi8yc8q23hkjyz3d1kqk6yy0s2xp00xv-nixos-system-zeus-24.05.20240830.6e99f2a"
        }
    }

Plan: 16 to add, 0 to change, 5 to destroy.
```
</details>

:memo: Plan generated in [Create OpenTofu plan #35](https://github.com/datasektionen/infra/actions/runs/11038359817)